{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f2518624",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-05T16:23:08.884849Z",
     "start_time": "2022-05-05T16:23:08.880941Z"
    }
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import py2neo\n",
    "import urllib.request as urllib\n",
    "from py2neo import Graph,Node,Relationship\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 146,
   "id": "2497cdd4",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-05T18:39:34.572881Z",
     "start_time": "2022-05-05T18:39:30.336276Z"
    },
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# esc =  eurovision song contest\n",
    "esc_1975_2019 =  \"eurovision_song_contest_1975_2019.xlsx\"\n",
    "esc_additional = \"Eurovision additional.xlsx\"\n",
    "geo_cepii = \"geo_cepii.xls\"\n",
    "iso2 = \"iso2.csv\"\n",
    "\n",
    "#load data in pandas df\n",
    "df_iso2 = pd.read_csv(\"data/\" + iso2)\n",
    "df_esc = pd.read_excel(\"data/\" + esc_1975_2019,sheet_name = \"Data\",header=0)\n",
    "df_geo = pd.read_excel(\"data/\" + geo_cepii,header=0)\n",
    "df_esc_additional = pd.read_excel(\"data/\" + esc_additional, header=0)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 147,
   "id": "d032045a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-05T18:40:18.860449Z",
     "start_time": "2022-05-05T18:39:34.572881Z"
    }
   },
   "outputs": [],
   "source": [
    "## This code converts the \"From country\" and \"To country\" columns df_esc to \"from_iso2\" and \"to_iso2\"\n",
    "\n",
    "faulty_countries = []\n",
    "def get_faulty_countries(country):\n",
    "    code = df_iso2.loc[df_iso2['Name'] == country][\"Code\"].values\n",
    "    if code.size == 0:\n",
    "        if country not in faulty_countries:\n",
    "            faulty_countries.append(country)\n",
    "            \n",
    "df_esc[\"From country\"].apply(get_faulty_countries)\n",
    "df_esc[\"To country\"].apply(get_faulty_countries)\n",
    "            \n",
    "# manual lookup in iso2file\n",
    "#in esc files Serbia and montenegro are 1 country TODO\n",
    "correct_countries = ['Netherlands','Macedonia, the Former Yugoslav Republic of', 'Bosnia and Herzegovina', 'Russian Federation', 'Macedonia, the Former Yugoslav Republic of','Serbia','Moldova, Republic of', 'Macedonia, the Former Yugoslav Republic of','Netherlands', 'Macedonia, the Former Yugoslav Republic of']\n",
    "df_country_lookup = pd.DataFrame({'faulty': faulty_countries,'correct':correct_countries})\n",
    "\n",
    "def fix_country(country):\n",
    "    new_country = df_country_lookup.loc[df_country_lookup[\"faulty\"] == country][\"correct\"].values \n",
    "    if new_country.size > 0:\n",
    "        return new_country[0]\n",
    "    else: \n",
    "        return Nan\n",
    "    \n",
    "def get_iso2(country):\n",
    "    code = df_iso2.loc[df_iso2['Name'] == country][\"Code\"].values\n",
    "    if code.size > 0:\n",
    "        return code[0]\n",
    "    else:\n",
    "        return df_iso2.loc[df_iso2['Name'] == fix_country(country)][\"Code\"].values[0]\n",
    "\n",
    "    \n",
    "df_esc[\"from_iso2\"] = df_esc[\"From country\"].apply(get_iso2)\n",
    "df_esc[\"to_iso2\"] = df_esc[\"To country\"].apply(get_iso2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 148,
   "id": "6356e1f8",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-05T18:41:37.961064Z",
     "start_time": "2022-05-05T18:40:18.860449Z"
    }
   },
   "outputs": [],
   "source": [
    "# copy features from df_geo to df_esc based on matching iso2 with \"from_iso2\" column\n",
    "geo_features = ['continent', 'langoff_1','lat','lon','colonizer1'] #features that seem interesting? TODO test\n",
    "for feature in geo_features:\n",
    "    df_esc[feature] = \"\"\n",
    "    for index, row in df_esc.iterrows():\n",
    "        val = df_geo.loc[df_geo[\"iso2\"]== row['from_iso2']][feature].values\n",
    "        if val.size > 0:\n",
    "            df_esc.loc[index,feature] = val[0]\n",
    "        else:\n",
    "            row[feature] = \"Nan\"\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "id": "bc10d07c",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-05T19:01:45.669874Z",
     "start_time": "2022-05-05T19:01:45.641840Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Year</th>\n",
       "      <th>(semi-) final</th>\n",
       "      <th>Edition</th>\n",
       "      <th>Jury or Televoting</th>\n",
       "      <th>From country</th>\n",
       "      <th>To country</th>\n",
       "      <th>Points</th>\n",
       "      <th>Duplicate</th>\n",
       "      <th>from_iso2</th>\n",
       "      <th>to_iso2</th>\n",
       "      <th>continent</th>\n",
       "      <th>langoff_1</th>\n",
       "      <th>lat</th>\n",
       "      <th>lon</th>\n",
       "      <th>colonizer1</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>0</td>\n",
       "      <td>x</td>\n",
       "      <td>BE</td>\n",
       "      <td>BE</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>Finland</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BE</td>\n",
       "      <td>FI</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>France</td>\n",
       "      <td>2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BE</td>\n",
       "      <td>FR</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>Germany</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BE</td>\n",
       "      <td>DE</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>Ireland</td>\n",
       "      <td>12</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BE</td>\n",
       "      <td>IE</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49827</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>Greece</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BY</td>\n",
       "      <td>GR</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49828</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>Germany</td>\n",
       "      <td>8</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BY</td>\n",
       "      <td>DE</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49829</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>0</td>\n",
       "      <td>x</td>\n",
       "      <td>BY</td>\n",
       "      <td>BY</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49830</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>The Netherlands</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BY</td>\n",
       "      <td>NL</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49831</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>Russia</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BY</td>\n",
       "      <td>RU</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>49832 rows × 15 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       Year (semi-) final Edition Jury or Televoting From country  \\\n",
       "0      1975             f   1975f                  J      Belgium   \n",
       "1      1975             f   1975f                  J      Belgium   \n",
       "2      1975             f   1975f                  J      Belgium   \n",
       "3      1975             f   1975f                  J      Belgium   \n",
       "4      1975             f   1975f                  J      Belgium   \n",
       "...     ...           ...     ...                ...          ...   \n",
       "49827  2019             f   2019f                  J      Belarus   \n",
       "49828  2019             f   2019f                  J      Belarus   \n",
       "49829  2019             f   2019f                  J      Belarus   \n",
       "49830  2019             f   2019f                  J      Belarus   \n",
       "49831  2019             f   2019f                  J      Belarus   \n",
       "\n",
       "            To country  Points       Duplicate from_iso2 to_iso2 continent  \\\n",
       "0              Belgium             0         x        BE      BE    Europe   \n",
       "1              Finland             0       NaN        BE      FI    Europe   \n",
       "2               France             2       NaN        BE      FR    Europe   \n",
       "3              Germany             0       NaN        BE      DE    Europe   \n",
       "4              Ireland            12       NaN        BE      IE    Europe   \n",
       "...                ...           ...       ...       ...     ...       ...   \n",
       "49827           Greece             0       NaN        BY      GR    Europe   \n",
       "49828          Germany             8       NaN        BY      DE    Europe   \n",
       "49829          Belarus             0         x        BY      BY    Europe   \n",
       "49830  The Netherlands             0       NaN        BY      NL    Europe   \n",
       "49831           Russia             0       NaN        BY      RU    Europe   \n",
       "\n",
       "         langoff_1       lat   lon colonizer1  \n",
       "0            Dutch  50.83333  4.35          .  \n",
       "1            Dutch  50.83333  4.35          .  \n",
       "2            Dutch  50.83333  4.35          .  \n",
       "3            Dutch  50.83333  4.35          .  \n",
       "4            Dutch  50.83333  4.35          .  \n",
       "...            ...       ...   ...        ...  \n",
       "49827  Belarussian     53.85  27.5        RUS  \n",
       "49828  Belarussian     53.85  27.5        RUS  \n",
       "49829  Belarussian     53.85  27.5        RUS  \n",
       "49830  Belarussian     53.85  27.5        RUS  \n",
       "49831  Belarussian     53.85  27.5        RUS  \n",
       "\n",
       "[49832 rows x 15 columns]"
      ]
     },
     "execution_count": 150,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_esc"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "742173d5",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-01T12:30:03.533479Z",
     "start_time": "2022-05-01T12:30:01.492311Z"
    }
   },
   "outputs": [],
   "source": [
    "# Connect to neo4j database\n",
    "f=open(\"authentication/neo4j.txt\",\"r\")\n",
    "lines=f.readlines()\n",
    "user=lines[0].replace('\\n','')\n",
    "pwd=lines[1].replace('\\n','')\n",
    "http_port = lines[2]\n",
    "f.close()\n",
    "\n",
    "graph = Graph(http_port, auth=(user, pwd))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "f60d835d",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-04-24T12:18:53.128097Z",
     "start_time": "2022-04-24T12:18:52.737910Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>count(*)</th></tr><tr><td style=\"text-align:right\">46</td></tr></table>"
      ],
      "text/plain": [
       " count(*) \n",
       "----------\n",
       "       46 "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# laod data in neo4j database\n",
    "# //Eurovision votes in the 2012,2013, 2014 and 2015 final session.\n",
    "fp = urllib.urlopen(\"https://goz39a.s3.eu-central-1.amazonaws.com/eurovision/eurovision.txt\")\n",
    "mybytes = fp.read()\n",
    "data = mybytes.decode(\"utf8\")\n",
    "fp.close()\n",
    "graph.run(data)\n",
    "graph.run(\"MATCH (n) RETURN count(*)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e8279d0a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-04-24T12:18:51.619563Z",
     "start_time": "2022-04-24T12:18:51.319492Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "((No data), (No data))"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "def clear_graph(): \n",
    "    return (graph.run(\"MATCH (n)-[r]->() DELETE r\"), graph.run(\"MATCH (n) DELETE n\"))\n",
    "    \n",
    "clear_graph()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
