{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "f2518624",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-07T10:28:45.909814Z",
     "start_time": "2022-05-07T10:28:45.400609Z"
    }
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import py2neo\n",
    "import urllib.request as urllib\n",
    "from py2neo import Graph,Node,Relationship\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "2497cdd4",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-07T10:28:51.974887Z",
     "start_time": "2022-05-07T10:28:47.284268Z"
    },
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "### esc =  eurovision song contest\n",
    "#https://www.kaggle.com/datasets/datagraver/eurovision-song-contest-scores-19752019?resource=download\n",
    "esc_1975_2019 =  \"eurovision_song_contest_1975_2019.xlsx\"\n",
    "\n",
    "esc_additional = \"Eurovision additional.xlsx\"\n",
    "\n",
    "#http://www.cepii.fr/cepii\n",
    "geo_cepii = \"geo_cepii.xls\"\n",
    "\n",
    "#https://github.com/geodatasource/country-borders/blob/master/GEODATASOURCE-COUNTRY-BORDERS.CSV\n",
    "geo_borders = \"GEODATASOURCE-COUNTRY-BORDERS.csv\"\n",
    "\n",
    "#https://datahub.io/core/country-list#resource-data\n",
    "iso2 = \"iso2.csv\"\n",
    "\n",
    "#load data in pandas df\n",
    "df_iso2_convert = pd.read_csv(\"data/\" + iso2)\n",
    "df_borders = pd.read_csv(\"data/\" + geo_borders)\n",
    "df_geo = pd.read_excel(\"data/\" + geo_cepii,header=0)\n",
    "df_additional = pd.read_excel(\"data/\" + esc_additional, header=0)\n",
    "\n",
    "df_esc = pd.read_excel(\"data/\" + esc_1975_2019,sheet_name = \"Data\",header=0)\n",
    "df_esc.drop([\"Duplicate\" , \"Edition\"], axis =1)\n",
    "df_features = []\n",
    "faulty_countries = []\n",
    "df_country_lookup = []"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "62f0db38",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-07T10:31:31.095272Z",
     "start_time": "2022-05-07T10:31:31.072699Z"
    }
   },
   "outputs": [],
   "source": [
    "\n",
    "def get_faulty_countries(country):\n",
    "    global faulty_countries\n",
    "    code = df_iso2_convert.loc[df_iso2_convert['Name'] == country][\"Code\"].values\n",
    "    if code.size == 0:\n",
    "        if country not in faulty_countries:\n",
    "            faulty_countries.append(country)\n",
    "\n",
    "def fix_country(country):\n",
    "    global df_country_lookup\n",
    "    new_country = df_country_lookup.loc[df_country_lookup[\"faulty\"] == country][\"correct\"].values \n",
    "    if new_country.size > 0:\n",
    "        return new_country[0]\n",
    "    else: \n",
    "        return \"Nan\"\n",
    "    \n",
    "def get_iso2(country):\n",
    "    code = df_iso2_convert.loc[df_iso2_convert['Name'] == country][\"Code\"].values\n",
    "    if code.size > 0:\n",
    "        return code[0]\n",
    "    else:\n",
    "        return df_iso2_convert.loc[df_iso2_convert['Name'] == fix_country(country)][\"Code\"].values[0]\n",
    "\n",
    "def country_to_iso2(df, columns = [] , lookup_table = []): # match the order of lookup_table to faulty countries\n",
    "    global faulty_countries\n",
    "    global df_country_lookup\n",
    "    faulty_countries = []\n",
    "    for column in columns:\n",
    "        df[column].apply(get_faulty_countries)\n",
    "        try: \n",
    "            df_country_lookup = pd.DataFrame({'faulty': faulty_countries, 'correct': lookup_table})\n",
    "        except:\n",
    "            print(\"lookup table does not size of faulty_countries table : \\n\" + \"lookup: \" + str(lookup_table) + \"\\n faulty: \" + str(faulty_countries) )\n",
    "            break\n",
    "        newname = column + '_iso2'\n",
    "        df[newname] = df[column].apply(get_iso2)\n",
    "        #df.drop([column], axis=1)\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "43c5589b",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-07T10:32:18.984904Z",
     "start_time": "2022-05-07T10:31:32.143639Z"
    }
   },
   "outputs": [],
   "source": [
    "\n",
    "lookup = ['Netherlands','Macedonia, the Former Yugoslav Republic of', 'Bosnia and Herzegovina', 'Russian Federation', 'Macedonia, the Former Yugoslav Republic of','Serbia','Moldova, Republic of', 'Macedonia, the Former Yugoslav Republic of','Netherlands', 'Macedonia, the Former Yugoslav Republic of']\n",
    "country_to_iso2(df_esc, ['From country', 'To country'], lookup )\n",
    "        \n",
    "lookup = ['Macedonia, the Former Yugoslav Republic of', 'Moldova, Republic of', 'Russian Federation']\n",
    "country_to_iso2(df_additional, [\"Unnamed: 0\"], lookup)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "f3bde0b8",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-07T10:34:34.881641Z",
     "start_time": "2022-05-07T10:34:33.540713Z"
    }
   },
   "outputs": [],
   "source": [
    "### create a lookup table for iso2\n",
    "iso2_list = []\n",
    "for index, row in df_esc.iterrows():   \n",
    "    iso2 = row[\"From country_iso2\"]\n",
    "    if iso2 not in iso2_list:\n",
    "        iso2_list.append(iso2)\n",
    "df_iso2 = df_iso2_convert[df_iso2_convert['Code'].isin(iso2_list)].set_index('Code')\n",
    "df_features = df_iso2.copy()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "61d24222",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-07T10:36:54.595379Z",
     "start_time": "2022-05-07T10:36:54.576367Z"
    }
   },
   "outputs": [],
   "source": [
    "def copy_features(df,iso2_column, features = []):    \n",
    "    for feature in features:\n",
    "        df_features[feature] = \"\"\n",
    "        for index, row in df_features.iterrows():\n",
    "            val = df.loc[df[iso2_column]== index][feature].values\n",
    "            if val.size > 0:\n",
    "                df_features.loc[index,feature] = val[0]\n",
    "            else:\n",
    "                row[feature] = \"Nan\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "016bac80",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-07T10:38:23.491601Z",
     "start_time": "2022-05-07T10:38:23.356979Z"
    }
   },
   "outputs": [],
   "source": [
    "geo_features = ['continent', 'langoff_1','lat','lon','colonizer1'] #features that seem interesting? \n",
    "copy_features(df_geo,\"iso2\", geo_features)\n",
    "\n",
    "additional_features = ['Religion', 'Most Common Country of Origin of Immigrants'] #features that seem interesting? \n",
    "copy_features(df_additional,\"Unnamed: 0_iso2\",additional_features)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "d032045a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-07T09:07:35.960293Z",
     "start_time": "2022-05-07T09:06:50.467428Z"
    },
    "collapsed": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Year</th>\n",
       "      <th>(semi-) final</th>\n",
       "      <th>Jury or Televoting</th>\n",
       "      <th>Points</th>\n",
       "      <th>from_iso2</th>\n",
       "      <th>to_iso2</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>0</td>\n",
       "      <td>BE</td>\n",
       "      <td>BE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>0</td>\n",
       "      <td>BE</td>\n",
       "      <td>FI</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>2</td>\n",
       "      <td>BE</td>\n",
       "      <td>FR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>0</td>\n",
       "      <td>BE</td>\n",
       "      <td>DE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>12</td>\n",
       "      <td>BE</td>\n",
       "      <td>IE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49827</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>0</td>\n",
       "      <td>BY</td>\n",
       "      <td>GR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49828</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>8</td>\n",
       "      <td>BY</td>\n",
       "      <td>DE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49829</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>0</td>\n",
       "      <td>BY</td>\n",
       "      <td>BY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49830</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>0</td>\n",
       "      <td>BY</td>\n",
       "      <td>NL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49831</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>J</td>\n",
       "      <td>0</td>\n",
       "      <td>BY</td>\n",
       "      <td>RU</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>49832 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       Year (semi-) final Jury or Televoting  Points       from_iso2 to_iso2\n",
       "0      1975             f                  J             0        BE      BE\n",
       "1      1975             f                  J             0        BE      FI\n",
       "2      1975             f                  J             2        BE      FR\n",
       "3      1975             f                  J             0        BE      DE\n",
       "4      1975             f                  J            12        BE      IE\n",
       "...     ...           ...                ...           ...       ...     ...\n",
       "49827  2019             f                  J             0        BY      GR\n",
       "49828  2019             f                  J             8        BY      DE\n",
       "49829  2019             f                  J             0        BY      BY\n",
       "49830  2019             f                  J             0        BY      NL\n",
       "49831  2019             f                  J             0        BY      RU\n",
       "\n",
       "[49832 rows x 6 columns]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "### copy features from df_geo into the iso2 lookup table\n",
    "\n",
    "\n",
    "\n",
    "for feature in geo_features:\n",
    "    df_features[feature] = \"\"\n",
    "    for index, row in df_features.iterrows():\n",
    "        val = df_geo.loc[df_geo[\"iso2\"]== index][feature].values\n",
    "        if val.size > 0:\n",
    "            df_features.loc[index,feature] = val[0]\n",
    "        else:\n",
    "            row[feature] = \"Nan\"\n",
    "\n",
    "### copy features from df_additional into the iso2 lookup table\n",
    "\n",
    "\n",
    "for feature in additional_features:\n",
    "    df_features[feature] = \"\"\n",
    "    for index, row in df_features.iterrows():\n",
    "        val = df_additional.loc[df_geo[\"iso2\"]== index][feature].values\n",
    "        if val.size > 0:\n",
    "            df_features.loc[index,feature] = val[0]\n",
    "        else:\n",
    "            row[feature] = \"Nan\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 150,
   "id": "bc10d07c",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-05T19:01:45.669874Z",
     "start_time": "2022-05-05T19:01:45.641840Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Year</th>\n",
       "      <th>(semi-) final</th>\n",
       "      <th>Edition</th>\n",
       "      <th>Jury or Televoting</th>\n",
       "      <th>From country</th>\n",
       "      <th>To country</th>\n",
       "      <th>Points</th>\n",
       "      <th>Duplicate</th>\n",
       "      <th>from_iso2</th>\n",
       "      <th>to_iso2</th>\n",
       "      <th>continent</th>\n",
       "      <th>langoff_1</th>\n",
       "      <th>lat</th>\n",
       "      <th>lon</th>\n",
       "      <th>colonizer1</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>0</td>\n",
       "      <td>x</td>\n",
       "      <td>BE</td>\n",
       "      <td>BE</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>Finland</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BE</td>\n",
       "      <td>FI</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>France</td>\n",
       "      <td>2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BE</td>\n",
       "      <td>FR</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>Germany</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BE</td>\n",
       "      <td>DE</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1975</td>\n",
       "      <td>f</td>\n",
       "      <td>1975f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belgium</td>\n",
       "      <td>Ireland</td>\n",
       "      <td>12</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BE</td>\n",
       "      <td>IE</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Dutch</td>\n",
       "      <td>50.83333</td>\n",
       "      <td>4.35</td>\n",
       "      <td>.</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49827</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>Greece</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BY</td>\n",
       "      <td>GR</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49828</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>Germany</td>\n",
       "      <td>8</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BY</td>\n",
       "      <td>DE</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49829</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>0</td>\n",
       "      <td>x</td>\n",
       "      <td>BY</td>\n",
       "      <td>BY</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49830</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>The Netherlands</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BY</td>\n",
       "      <td>NL</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49831</th>\n",
       "      <td>2019</td>\n",
       "      <td>f</td>\n",
       "      <td>2019f</td>\n",
       "      <td>J</td>\n",
       "      <td>Belarus</td>\n",
       "      <td>Russia</td>\n",
       "      <td>0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>BY</td>\n",
       "      <td>RU</td>\n",
       "      <td>Europe</td>\n",
       "      <td>Belarussian</td>\n",
       "      <td>53.85</td>\n",
       "      <td>27.5</td>\n",
       "      <td>RUS</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>49832 rows × 15 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       Year (semi-) final Edition Jury or Televoting From country  \\\n",
       "0      1975             f   1975f                  J      Belgium   \n",
       "1      1975             f   1975f                  J      Belgium   \n",
       "2      1975             f   1975f                  J      Belgium   \n",
       "3      1975             f   1975f                  J      Belgium   \n",
       "4      1975             f   1975f                  J      Belgium   \n",
       "...     ...           ...     ...                ...          ...   \n",
       "49827  2019             f   2019f                  J      Belarus   \n",
       "49828  2019             f   2019f                  J      Belarus   \n",
       "49829  2019             f   2019f                  J      Belarus   \n",
       "49830  2019             f   2019f                  J      Belarus   \n",
       "49831  2019             f   2019f                  J      Belarus   \n",
       "\n",
       "            To country  Points       Duplicate from_iso2 to_iso2 continent  \\\n",
       "0              Belgium             0         x        BE      BE    Europe   \n",
       "1              Finland             0       NaN        BE      FI    Europe   \n",
       "2               France             2       NaN        BE      FR    Europe   \n",
       "3              Germany             0       NaN        BE      DE    Europe   \n",
       "4              Ireland            12       NaN        BE      IE    Europe   \n",
       "...                ...           ...       ...       ...     ...       ...   \n",
       "49827           Greece             0       NaN        BY      GR    Europe   \n",
       "49828          Germany             8       NaN        BY      DE    Europe   \n",
       "49829          Belarus             0         x        BY      BY    Europe   \n",
       "49830  The Netherlands             0       NaN        BY      NL    Europe   \n",
       "49831           Russia             0       NaN        BY      RU    Europe   \n",
       "\n",
       "         langoff_1       lat   lon colonizer1  \n",
       "0            Dutch  50.83333  4.35          .  \n",
       "1            Dutch  50.83333  4.35          .  \n",
       "2            Dutch  50.83333  4.35          .  \n",
       "3            Dutch  50.83333  4.35          .  \n",
       "4            Dutch  50.83333  4.35          .  \n",
       "...            ...       ...   ...        ...  \n",
       "49827  Belarussian     53.85  27.5        RUS  \n",
       "49828  Belarussian     53.85  27.5        RUS  \n",
       "49829  Belarussian     53.85  27.5        RUS  \n",
       "49830  Belarussian     53.85  27.5        RUS  \n",
       "49831  Belarussian     53.85  27.5        RUS  \n",
       "\n",
       "[49832 rows x 15 columns]"
      ]
     },
     "execution_count": 150,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_esc"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "742173d5",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-05-01T12:30:03.533479Z",
     "start_time": "2022-05-01T12:30:01.492311Z"
    }
   },
   "outputs": [],
   "source": [
    "# Connect to neo4j database\n",
    "f=open(\"authentication/neo4j.txt\",\"r\")\n",
    "lines=f.readlines()\n",
    "user=lines[0].replace('\\n','')\n",
    "pwd=lines[1].replace('\\n','')\n",
    "http_port = lines[2]\n",
    "f.close()\n",
    "\n",
    "graph = Graph(http_port, auth=(user, pwd))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "f60d835d",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-04-24T12:18:53.128097Z",
     "start_time": "2022-04-24T12:18:52.737910Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<table><tr><th>count(*)</th></tr><tr><td style=\"text-align:right\">46</td></tr></table>"
      ],
      "text/plain": [
       " count(*) \n",
       "----------\n",
       "       46 "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# laod data in neo4j database\n",
    "# //Eurovision votes in the 2012,2013, 2014 and 2015 final session. (data already included in esc_1975_2019 data set? )\n",
    "fp = urllib.urlopen(\"https://goz39a.s3.eu-central-1.amazonaws.com/eurovision/eurovision.txt\")\n",
    "mybytes = fp.read()\n",
    "data = mybytes.decode(\"utf8\")\n",
    "fp.close()\n",
    "graph.run(data)\n",
    "graph.run(\"MATCH (n) RETURN count(*)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "e8279d0a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2022-04-24T12:18:51.619563Z",
     "start_time": "2022-04-24T12:18:51.319492Z"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "((No data), (No data))"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "def clear_graph(): \n",
    "    return (graph.run(\"MATCH (n)-[r]->() DELETE r\"), graph.run(\"MATCH (n) DELETE n\"))\n",
    "    \n",
    "clear_graph()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.7"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": false,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {},
   "toc_section_display": true,
   "toc_window_display": false
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
